Revit 2027 API
NumberingSchema.GetUseBuiltInMatchingForCategories Method
 Get the set of categories where the built-in matching criteria is used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetUseBuiltInMatchingForCategories()
Public Function GetUseBuiltInMatchingForCategories As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetUseBuiltInMatchingForCategories()
member GetUseBuiltInMatchingForCategories : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the set of categories that have built-in matching enabled for this schema.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace